import React from 'react';
import {Layout, Row, Col, Typography,Flex} from "antd";

import { useNavigate} from "react-router-dom";
import Link from "antd/es/typography/Link";

const Footer = () => {
    const handleNavigate = (sectionId) => {
        window.location.href = `#${sectionId}`;
    };
    const navigate = useNavigate();
    return (
        <Layout.Footer style={{ background: "#2E3B2F", color: "white", padding: "60px 100px" ,paddingBottom: 0,  position: "relative"}}>
                <Row gutter={[16, 16]} justify="space-between" style={{ paddingBottom: "100px" }}>
                    <Col xs={20} sm={10} md={6}>
                        <Flex vertical gap={20}>
                            <svg width="117" height="51" viewBox="0 0 117 51" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path d="M6.5 13.25V28.75" stroke="white" stroke-width="2" stroke-linecap="round"
                                      stroke-linejoin="round"/>
                                <path
                                    d="M10.6626 42.7C12.1635 40.3212 14.2149 38.367 16.6312 37.0143C19.0474 35.6616 21.752 34.9531 24.5001 34.9531C27.2482 34.9531 29.9528 35.6616 32.369 37.0143C34.7853 38.367 36.8367 40.3212 38.3376 42.7"
                                    fill="#344333"/>
                                <path
                                    d="M10.6626 42.7C12.1635 40.3212 14.2149 38.367 16.6312 37.0143C19.0474 35.6616 21.752 34.9531 24.5001 34.9531C27.2482 34.9531 29.9528 35.6616 32.369 37.0143C34.7853 38.367 36.8367 40.3212 38.3376 42.7"
                                    stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                                <path d="M42.5 13.2498L24.5 19.4498L6.5 13.2498L24.5 7.0498L42.5 13.2498Z"
                                      fill="#344333"
                                      stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                                <path
                                    d="M32.2438 16.7754C33.6197 18.3281 34.5288 20.2609 34.8602 22.3381C35.1916 24.4154 34.9309 26.5475 34.1101 28.4743C33.2892 30.4012 31.9436 32.0397 30.2372 33.1901C28.5308 34.3404 26.5374 34.9529 24.5 34.9529C22.4626 34.9529 20.4692 34.3404 18.7628 33.1901C17.0564 32.0397 15.7108 30.4012 14.8899 28.4743C14.0691 26.5475 13.8084 24.4154 14.1398 22.3381C14.4712 20.2609 15.3803 18.3281 16.7563 16.7754"
                                    fill="#344333"/>
                                <path
                                    d="M32.2438 16.7754C33.6197 18.3281 34.5288 20.2609 34.8602 22.3381C35.1916 24.4154 34.9309 26.5475 34.1101 28.4743C33.2892 30.4012 31.9436 32.0397 30.2372 33.1901C28.5308 34.3404 26.5374 34.9529 24.5 34.9529C22.4626 34.9529 20.4692 34.3404 18.7628 33.1901C17.0564 32.0397 15.7108 30.4012 14.8899 28.4743C14.0691 26.5475 13.8084 24.4154 14.1398 22.3381C14.4712 20.2609 15.3803 18.3281 16.7563 16.7754"
                                    stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                                <path
                                    d="M52.02 24.6018V26.5858H56.5V29.0498H49.46V17.8498H56.42V20.3138H52.02V22.1698H56.02V24.6018H52.02ZM63.6761 21.8018V17.8498H66.0761V29.0498H63.6761V28.2978C63.1215 28.9485 62.3268 29.2738 61.2921 29.2738C60.2361 29.2738 59.3348 28.8685 58.5881 28.0578C57.8415 27.2471 57.4681 26.2445 57.4681 25.0498C57.4681 23.8658 57.8415 22.8685 58.5881 22.0578C59.3455 21.2365 60.2468 20.8258 61.2921 20.8258C62.3268 20.8258 63.1215 21.1511 63.6761 21.8018ZM59.8681 25.0498C59.8681 25.6471 60.0441 26.1218 60.3961 26.4738C60.7481 26.8258 61.2068 27.0018 61.7721 27.0018C62.3375 27.0018 62.7961 26.8258 63.1481 26.4738C63.5001 26.1218 63.6761 25.6471 63.6761 25.0498C63.6761 24.4525 63.5001 23.9778 63.1481 23.6258C62.7961 23.2738 62.3375 23.0978 61.7721 23.0978C61.2068 23.0978 60.7481 23.2738 60.3961 23.6258C60.0441 23.9778 59.8681 24.4525 59.8681 25.0498ZM71.4369 26.1218L73.1009 21.0498H75.7569L72.7969 29.0498H70.0769L67.1169 21.0498H69.7729L71.4369 26.1218ZM84.309 26.0098H78.629C78.8957 26.7565 79.5357 27.1298 80.549 27.1298C81.1997 27.1298 81.7117 26.9271 82.085 26.5218L84.005 27.6258C83.2263 28.7245 82.0637 29.2738 80.517 29.2738C79.1837 29.2738 78.1063 28.8738 77.285 28.0738C76.485 27.2738 76.085 26.2658 76.085 25.0498C76.085 23.8551 76.4797 22.8525 77.269 22.0418C78.069 21.2311 79.093 20.8258 80.341 20.8258C81.5037 20.8258 82.469 21.2311 83.237 22.0418C84.0157 22.8311 84.405 23.8338 84.405 25.0498C84.405 25.3911 84.373 25.7111 84.309 26.0098ZM78.581 24.2178H82.021C81.7863 23.3751 81.221 22.9538 80.325 22.9538C79.397 22.9538 78.8157 23.3751 78.581 24.2178ZM90.6142 20.8258C91.4782 20.8258 92.1876 21.1191 92.7422 21.7058C93.3182 22.3031 93.6062 23.1138 93.6062 24.1378V29.0498H91.2062V24.4898C91.2062 24.0311 91.0782 23.6738 90.8222 23.4178C90.5662 23.1618 90.2302 23.0338 89.8142 23.0338C89.3449 23.0338 88.9769 23.1778 88.7102 23.4658C88.4542 23.7431 88.3262 24.1485 88.3262 24.6818V29.0498H85.9262V21.0498H88.3262V21.8018C88.8062 21.1511 89.5689 20.8258 90.6142 20.8258ZM100.102 21.0498V23.3538H98.4544V26.1858C98.4544 26.4951 98.577 26.6978 98.8224 26.7938C99.0677 26.8791 99.4944 26.9058 100.102 26.8738V29.0498C98.5877 29.2098 97.5317 29.0658 96.9344 28.6178C96.3477 28.1591 96.0544 27.3485 96.0544 26.1858V23.3538H94.7744V21.0498H96.0544V19.5298L98.4544 18.8098V21.0498H100.102ZM106.945 25.4178V21.0498H109.345V29.0498H106.945V28.2978C106.465 28.9485 105.703 29.2738 104.657 29.2738C103.804 29.2738 103.089 28.9805 102.513 28.3938C101.948 27.7965 101.665 26.9858 101.665 25.9618V21.0498H104.065V25.6098C104.065 26.0685 104.193 26.4258 104.449 26.6818C104.705 26.9378 105.041 27.0658 105.457 27.0658C105.927 27.0658 106.289 26.9271 106.545 26.6498C106.812 26.3618 106.945 25.9511 106.945 25.4178ZM113.666 21.0498V22.4738C113.815 21.9725 114.108 21.5831 114.546 21.3058C114.994 21.0285 115.5 20.8898 116.066 20.8898V23.6098C115.468 23.5138 114.919 23.6151 114.418 23.9138C113.916 24.2018 113.666 24.7085 113.666 25.4338V29.0498H111.266V21.0498H113.666Z"
                                    fill="white"/>
                            </svg>
                            <Typography.Text style={{color: "#BFBFBF", maxWidth: 300}}>
                                Цифровая интерактивная академическая платформа для участия в программах
                                внутрироссийского семестрового обмена
                            </Typography.Text>
                        </Flex>

                    </Col>

                    <Col xs={22} sm={12} md={10}>
                        <Flex gap={100} justify="flex-end">
                            <Flex vertical gap={10} style={{ alignItems: "flex-end" }}>
                                <Typography.Text style={{ color: 'white', whiteSpace: 'nowrap' }}>
                                    Обучение
                                </Typography.Text>
                                <Link onClick={() => navigate('/application')} style={{ color: '#BFBFBF', whiteSpace: 'nowrap', cursor: "pointer" }}>
                                    Подать заявку
                                </Link>
                                <Link onClick={() => navigate('/partners')} style={{ color: '#BFBFBF', whiteSpace: 'nowrap', cursor: "pointer" }}>
                                    ВУЗ-ы партнеры
                                </Link>
                                <Link onClick={() => navigate('/programs')} style={{ color: '#BFBFBF', whiteSpace: 'nowrap', cursor: "pointer" }}>
                                    Образовательные программы
                                </Link>
                            </Flex>

                            <Flex vertical gap={10} style={{ alignItems: "flex-end" }}>
                                <Typography.Text style={{ color: 'white', whiteSpace: 'nowrap' }}>Информация</Typography.Text>
                                <Link onClick={() => handleNavigate('about')} style={{ color: '#BFBFBF', whiteSpace: 'nowrap' }}>
                                    О нас
                                </Link>
                                <Link onClick={() => handleNavigate('faq')} style={{ color: '#BFBFBF', whiteSpace: 'nowrap' }}>
                                    Частые вопросы
                                </Link>
                            </Flex>
                        </Flex>
                    </Col>
                </Row>

            <Flex
                style={{
                    background: "#232323",
                    position: "absolute",
                    left: 0,
                    width: "100%",
                    padding: "12px 100px",
                }}
                justify="space-between"
                align="center"
            >
                <Row style={{ width: "100%" }} justify="space-between" align="middle">
                    <Typography.Text style={{ color: "#BFBFBF" }}>© 2025 Edventur</Typography.Text>
                    <Flex gap={15}>
                        <Link style={{ color: "#BFBFBF" }}>Пользовательское соглашение</Link>
                        <Link style={{ color: "#BFBFBF" }}>Политика конфиденциальности</Link>
                    </Flex>
                </Row>
            </Flex>

        </Layout.Footer>
    );
};

export default Footer;